{
    "products": [
        {
            "name": "آيفون 13 برو",
            "price": 1099,
            "specs": "شاشة Super Retina XDR بحجم 6.1 بوصة، معالج A15 Bionic، سعة تخزين 128 جيجابايت",
            "description": "يتميز آيفون 13 برو بشاشة رائعة وأداء قوي ومساحة تخزين واسعة لجميع احتياجاتك.",
            "reviews": 142,
            "sold": 234,
            "left": 766
        },
        {
            "name": "ماك بوك برو 16 بوصة",
            "price": 2399,
            "specs": "شاشة Retina بحجم 16 بوصة، معالج إنتل كور i7، ذاكرة وصول عشوائي 16 جيجابايت، وحدة تخزين SSD بسعة 512 جيجابايت",
            "description": "يوفر ماك بوك برو 16 بوصة أداء استثنائيًا وشاشة جميلة، مما يجعله الاختيار المثالي للمحترفين.",
            "reviews": 98,
            "sold": 178,
            "left": 322
        },
        {
            "name": "آيباد آير",
            "price": 599,
            "specs": "شاشة Liquid Retina بحجم 10.9 بوصة، معالج A14 Bionic، سعة تخزين 64 جيجابايت",
            "description": "يجمع آيباد آير بين القوة والتنوع، مما يتيح لك العمل واللعب أثناء التنقل.",
            "reviews": 241,
            "sold": 412,
            "left": 588
        },
        {
            "name": "ساعة أبل سيريز 7",
            "price": 399,
            "specs": "شاشة Retina مستمرة العرض، تطبيق ECG، مراقبة معدل ضربات القلب",
            "description": "تبقي ساعة أبل سيريز 7 متصلًا بك وتتتبع صحتك ولياقتك طوال اليوم.",
            "reviews": 86,
            "sold": 256,
            "left": 744
        },
        {
            "name": "سماعات AirPods برو",
            "price": 249,
            "specs": "إلغاء الضوضاء النشط، وضع الشفافية، مقاومة للعرق والماء",
            "description": "توفر سماعات AirPods برو صوتًا غامرًا وملاءمة مريحة لتجربة استماع متفوقة.",
            "reviews": 312,
            "sold": 765,
            "left": 235
        },
        {
            "name": "آيماك 27 بوصة",
            "price": 1799,
            "specs": "شاشة Retina 5K بحجم 27 بوصة، معالج إنتل كور i7 ثماني النواة، وحدة تخزين SSD بسعة 512 جيجابايت، راديون برو 5300",
            "description": "يوفر آيماك 27 بوصة تجربة بصرية مذهلة وأداء قوي للمحترفين الإبداعيين.",
            "reviews": 76,
            "sold": 125,
            "left": 375
        },
        {
            "name": "أبل تي في 4K",
            "price": 179,
            "specs": "4K High Dynamic Range (Dolby Vision)، ريموت Siri، شريحة A12 Bionic",
            "description": "يجلب أبل تي في 4K مسلسلاتك وأفلامك المفضلة إلى الحياة مع جودة صورة مذهلة وصوت محيطي.",
            "reviews": 189,
            "sold": 321,
            "left": 679
        },
        {
            "name": "ماك ميني",
            "price": 699,
            "specs": "شريحة أبل M1 ثماني النواة، ذاكرة موحدة سعة 8 جيجابايت، وحدة تخزين SSD بسعة 256 جيجابايت",
            "description": "يقدم ماك ميني أداءً قويًا في تصميم صغير الحجم، مما يجعله حلاً متعدد الاستخدامات لسطح المكتب.",
            "reviews": 51,
            "sold": 289,
            "left": 711
        },
        {
            "name": "آيباد برو",
            "price": 799,
            "specs": "شاشة Liquid Retina بحجم 11 بوصة، شريحة M1، سعة تخزين 128 جيجابايت",
            "description": "يقدم آيباد برو أداءً مثل الكمبيوتر الشخصي وشاشة رائعة، مثالي للمحترفين الإبداعيين.",
            "reviews": 231,
            "sold": 512,
            "left": 488
        },
        {
            "name": "ماك برو",
            "price": 5999,
            "specs": "معالج إنتل كزيون W، ذاكرة وصول عشوائي 32 جيجابايت، وحدة تخزين SSD بسعة 1 تيرابايت، راديون برو 580X",
            "description": "يعد ماك برو قوة عاملة للمحترفين الذين يتطلبون أداءً من الطراز الأول وإمكانية التوسع.",
            "reviews": 32,
            "sold": 54,
            "left": 446
        }
    ]
}